Repository: EslamHanafy/ESCore
Catalog: ESCore/Resources/*.lproj/Localizable.strings
Languages: ar

# appName
source: Moddakir
ar: مدّٙكر

# currency
source: SAR
ar: ر.س

source: Ok
ar: حسنا

# unknownError
source: Sorry, there is something went wrong, please try again later
ar: عذرًا ، حدث خطأ ما ، يرجى إعادة المحاولة لاحقًا

# noInternet
source: Sorry, there is no internet connection
ar: عذرا لايوجد اتصال بالانترنت

# internetConnected
source: The internet has been connected again successfully
ar: تم توصيل الإنترنت بنجاح مرة أخرى

# unauthorized
source: Couldn't authenticate with current credential
ar: لا يمكن المصادقة باستخدام بيانات الاعتماد الحالية

# itemsNotFound
source: Sorry, no results found
ar: عذرا ، لم يتم العثور على نتائج

# forbidden
source: Your session has expired, or you logged in from another device, please login again to your account
ar: انتهت جلستك ، أو قمت بتسجيل الدخول من جهاز آخر ، يرجى تسجيل الدخول مرة أخرى إلى حسابك

source: Try again
ar: حاول مجددا

source: Cancel
ar: إلغاء

source: Yes
ar: نعم

source: No
ar: لا

source: Edit
ar: تعديل

source: Delete
ar: حذف

# editsSucceed
source: Your edits have been saved successfully
ar: تم حفظ تعديلاتك بنجاح

# noChanges
source: There are no changes
ar: لا توجد تعديلات

source: Loading...
ar: جار التحميل...

# authFaild
source: Unable to authenticate with the current credentials (Email And Password).
ar: غير قادر على المصادقة باستخدام بيانات الاعتماد الحالية (البريد الإلكتروني وكلمة المرور).

# emptyData
source: There is no data to be sent!
ar: لا توجد بيانات ليتم إرسالها!

# cancelRequest
source: Are you sure you want to cancel this request?
ar: هل أنت متأكد أنك تريد إلغاء هذا الطلب؟

# emptyEmail
source: Enter your email
ar: أدخل بريدك الالكتروني

# emptyPassword
source: Enter your password
ar: ادخل رقمك السري

# emailNotValid
source: Enter a valid email
ar: أدخل عنوان بريد إلكتروني صالح

# testNotification
source: Notification test
ar: اشعار تجريبي

# testNotificationBody
source: This is how you will receive notifications from us
ar: هذه هي الطريقة التي سوف تتلقى بها اشعارات منا

# chooseCountryCode
source: Select the country code
ar: اختر كود البلد

# chooesYourCountry
source: Choose your country
ar: اختر بلدك

# imageNotValid
source: Sorry, the selected image wasn't valid, please try again with a different image
ar: عذرًا ، الصورة المحددة غير صالحة ، يرجى إعادة المحاولة باستخدام صورة مختلفة

source: Uploading...
ar: جار الرفع...

source: Later
ar: في وقت لاحق

source: Old Version!
ar: إصدار قديم!

# oldVersionMessage
source: Sorry, you are using an old version of the app, you must update to continue using the app, Thanks for using Moddakir app
ar: عذرًا ، أنت تستخدم إصدارًا قديمًا من التطبيق ، يجب عليك التحديث لمتابعة استخدام التطبيق ، شكرًا لاستخدام تطبيق مُدكر

source: Update
ar: تحديث

source: Logging Out!
ar: تسجيل الخروج!

# loggingoutMessage
source: Are you sure you want to logout from your account?
ar: هل أنت متأكد أنك تريد تسجيل الخروج من حسابك؟

source: Open Settings
ar: أفتح الإعدادات

source: Connecting..
ar: جار الاتصال

source: Ended
ar: انتهت المكالمة

# receivingCallFrom
source: Receiving a call from
ar: تلقي مكالمة من

# waitingForResponse
source: Contacting the teacher
ar: جار الإتصال بالمعلم/ة

source: Canceled
ar: ألغيت

source: Denied
ar: تم الرفض

source: Hangup
ar: تم الانهاء

source: No Answer
ar: لايوجد رد

source: Not Found
ar: لم يتم العثور على الشخص

# missedCallMessage
source: You have missed a call from %@
ar: لقد فاتتك مكالمة من %@

# closeMic
source: Mute Sounds
ar: كتم الأصوات

# openMic
source: Play Sounds
ar: تشغيل الأصوات

source: Close Speaker
ar: اغلاق مكبر الصوت

source: Open Speaker
ar: تشغيل مكبر الصوت

# sorryForNotAnswer
source: We apologize for not answering the teacher
ar: نحن نعتذر علي عدم رد المعلم

# sinchAccountChanged
source: Sorry, we couldn't complete this call, please try again within a few seconds
ar: عذرًا ، لم نتمكن من إتمام هذه المكالمة ، يرجى المحاولة مرة أخرى في غضون بضع ثوان

# callInterruptedMessage
source: Sorry, the call from the other person was interrupted, trying to reconnect again
ar: عذرًا ، تمت مقاطعة المكالمة من الشخص الآخر ، جار محاولة اعادة الاتصال مرة أخرى

source: Call Interrupted !!
ar: تمت مقاطعة المكالمة !!

source: Recording Permission!
ar: إذن التسجيل!

# recordingPermissionMessage
source: We need access to your microphone to be able to make calls through the app
ar: نحتاج إلى الوصول إلى الميكروفون الخاص بك لتتمكن من إجراء مكالمات من خلال التطبيق

# teacherNotAvailable
source: Teacher is not available
ar: المعلم غير متوفر

source: None
ar: لا شيء

source: Call Expired
ar: انتهت صلاحية المكالمة

# couldNotConnectToCall
source: Could not connect to the call
ar: تعذر الاتصال بالمكالمة

# connectingToCall
source: Call connecting in progress..
ar: جار الاتصال بالمكالمة..

# ConnectionStatus_good
source: Good Connection..
ar: اتصال جيد ..

# ConnectionStatus_weak
source: Weak Conncection..
ar: اتصال ضعيف ..

# ConnectionStatus_bad
source: Bad Connection..
ar: اتصال ردئ..

# selectImageTile
source: Choose the image source
ar: اختيار مصدر الصورة

# fromGallery
source: From The Gallery
ar: من المعرض

# fromCamera
source: Capture New Image
ar: التقاط صورة جديدة

source: Delete Image
ar: حذف الصورة

# deleteImageMessage
source: Are you sure you want to delete this image?
ar: هل أنت متأكد أنك تريد حذف هذه الصورة؟

source: Online
ar: متصل

source: Busy
ar: مشغول

source: Offline
ar: غير متصل

source: Languages
ar: اللغات

source: Close
ar: اغلاق

source: Holy Quran
ar: القرآن الكريم

source: Saturday
ar: السبت

source: Sunday
ar: الأحد

source: Monday
ar: الإثنين

source: Tuesday
ar: الثلاثاء

source: Wednesday
ar: الأربعاء

source: Thursday
ar: الخميس

source: Friday
ar: الجمعة

source: hours
ar: ساعات

source: hour
ar: ساعة

source: minutes
ar: دقيقة

source: years
ar: عام

source: year
ar: عام

source: months
ar: أشهر

source: month
ar: شهر

source: days
ar: يوم

source: day
ar: يوم

source: seconds
ar: ثانية

source: second
ar: ثانية

# selectReason
source: You have to select the reasons for this report
ar: يجب عليك تحديد أسباب هذا التقرير

# reportSuccess
source: Your report added successfully, our team will review it as soon as possible
ar: تمت إضافة تقريرك بنجاح ، وسيقوم فريقنا بمراجعته في أقرب وقت ممكن

# reportStudent
source: Report A Student
ar: إبلاغ عن طالب

# reportTeacher
source: Report A Teacher
ar: إبلاغ عن معلم

# otherReasons
source: Other Reasones
ar: أسباب اخرى

# emptyComment
source: Type the reason for this report
ar: اكتب سبب هذا التقرير

source: Listening
ar: تسميع

source: Recitation
ar: تلاوة

source: Initiation
ar: تلقين

# emptySurah
source: Please, select the surah firstly
ar: من فضلك ، اختر السورة أولا

source: Surah Name
ar: اسم السورة

source: ayah
ar: الآية

source: Select session type
ar: اختر نوع الجلسة

source: Select surah name
ar: اختر اسم السورة

# selectAyah
source: Select ayah number
ar: اختر رقم الآية

# emptyValidRecords
source: Please, enter what happened in the last session
ar: من فضلك ، أدخل ما حدث في الجلسة الأخيرة

source: Record Number
ar: سجل رقم

# sessionRecordNotValid
source: Please enter all the required data to continue
ar: يرجى إدخال جميع البيانات المطلوبة للمتابعة

# ayahAfterStartAyah
source: You can't select end ayah that comes before the start ayah
ar: لا يمكنك اختيار نهاية الآية التي تأتي قبل بداية الآية

# surahAfterStartSurah
source: You can't select end surah that comes before the start surah
ar: لا يمكنك اختيار سورة النهاية التي تأتي قبل سورة البداية

# confirmAddSessionMessage
source: Do you want to add another record or do you want to finish and submit?
ar: هل تريد إضافة سجل آخر أم تريد الانتهاء و الارسال؟

source: Submit
ar: إرسال

source: Add New Record
ar: إضافة سجل جديد

# noBalance
source: Sorry, you don't have enough balance to continue this call
ar: عذرًا ، ليس لديك رصيد كافٍ لمتابعة هذه المكالمة

# minBalanceAlert
source: Your current balance is less than 10%, please buy a new package to avoid stopping the service
ar: رصيدك الحالي أقل من 10٪ ، يرجى شراء حزمة جديدة لتجنب إيقاف الخدمة

source: Session Type
ar: نوع الجلسة

source: Open Camera
ar: افتح الكاميرا

source: Close Camera
ar: أغلق الكاميرا

# callWillEnd
source: Call Ending
ar: إنهاء المكالمة

# callWillEndMessage
source: The call will be ended automatically at %@, are you want to continue the call after this time?
ar: سيتم إنهاء المكالمة تلقائيًا الساعة %@ هل ترغب في متابعة المكالمة بعد هذا الوقت؟

# emptyTeacherRate
source: Please, rate the teacher
ar: يرجى تقييم المعلم

# currentBalance
source: Balance:
ar: الرصيد:

source: Old Notifications
ar: الإشعارات القديمة

source: New Notifications
ar: الإشعارات الجديدة

# emptyMessage
source: Please type your message
ar: يرجى كتابة رسالتك

source: Type Message
ar: اكتب الرسالة

# messageSent
source: Your message has been sent successfully, thanks for using Moddakir
ar: تم إرسال رسالتك بنجاح ، شكرا لاستخدام مُدكر
